import { BaseHelpers } from "./helpers/base-helpers";
BaseHelpers.addLoadedClass();
BaseHelpers.calcScrollbarWidth();
BaseHelpers.addTouchClass();

/*--------------------------------------------------------------------------------------------------------------
Обработчик "Добавить в избранное" - LIKES LISTENER 
----------------------------------------------------------------------------------------------------------------*/
import "./mini/likes-listener.js";
/* ------------------------------------------------------------------------------------------------------------------------------
Миграция блоков и элементов при адаптиве - TRANSFER ELEMENTS
--------------------------------------------------------------------------------------------------------------------------------*/
import "./sections/transfer-elements.js";
/* ------------------------------------------------------------------------------------------------------------------------------
Инициализация слайдера ПРЕИМУЩЕСТВА на ГЛАВНОЙ - KEEN ADVANTAGE SLIDER
--------------------------------------------------------------------------------------------------------------------------------*/
import "./sections/advantage-slider.js";
/* ------------------------------------------------------------------------------------------------------------------------------
Инициализация слайдера ПОПУЛЯРНЫЕ ТОВАРЫ на ГЛАВНОЙ странице -  SWIPER POPULAR PRODUCTS SLIDER
--------------------------------------------------------------------------------------------------------------------------------*/
import "./sections/popular-products-slider.js";
/* ------------------------------------------------------------------------------------------------------------------------------
Инициализация слайдера МОИ ТОВАРЫ на страницах ЛИЧНОГО КАБИНЕТА -  SWIPER MY PRODUCTS SLIDER
--------------------------------------------------------------------------------------------------------------------------------*/
import "./sections/myproducts-slider.js";
/* ------------------------------------------------------------------------------------------------------------------------------
Инициализация первого слайдера на ГЛАВНОЙ - SWIPER MARKETING SLIDER
--------------------------------------------------------------------------------------------------------------------------------*/
import "./sections/marketing-slider.js";
/* ------------------------------------------------------------------------------------------------------------------------------
Инициализация слайдера в блоке КОМПАНИИ - SWIPER COMPANYS SLIDER
--------------------------------------------------------------------------------------------------------------------------------*/
import "./sections/companys-slider.js";
/* ------------------------------------------------------------------------------------------------------------------------------
Инициализация слайдера с миниатюрами в галлереи на странице товара - SWIPER PORODUCT GALLERY THUMBNAILS
--------------------------------------------------------------------------------------------------------------------------------*/
import "./sections/product-thumbnails-slider.js";

/* --------------------------------------------------------------------------------------------------------------------------
Паралакс для галлереи на странице товара
-----------------------------------------------------------------------------------------------------------------------------*/
import "./modules/product-gallery-parallax.js";

/*--------------------------------------------------------------------------------------------------------------
Обработчик кнопки КАТАЛОГ и внутренностей большого выпадающего меню с категориями (в мобильной и дестопной версии)
----------------------------------------------------------------------------------------------------------------*/
import CatsMenu from "./modules/cats-menu-prod";

const categoriesOverlayMenu = document.querySelector(".exp-catalog");
categoriesOverlayMenu &&
	new CatsMenu({
		parent: ".exp-catalog",
		openBtn: "#catalog-btn",
		catButton: "data-catIDoverlay",
		catBlock: "data-blockIDoverlay",
		backButton: "data-subcatback='overlay'",
		closeButton: "data-catsclose='overlay'",
		openSubListButton: "data-subcatslist='overlay'",
	});

/* --------------------------------------------------------------------------------------------------------------------------
Инициализация FANCYBOX
-----------------------------------------------------------------------------------------------------------------------------*/
Fancybox.bind("[data-fancybox]", {
	Carousel: {
		transition: "slide",
	},
	Images: {
		zoom: false,
	},
	showClass: "f-fadeIn",
});

/* --------------------------------------------------------------------------------------------------------------------------
Рейтинг на странице продукта (выбор кол-ва звезд в форме ОПЫТ ПОЛЬЗОВАТЕЛЯ)
-----------------------------------------------------------------------------------------------------------------------------*/
import StarRating from "./modules/rating-stars.js";
document.addEventListener("DOMContentLoaded", () => {
	const expirienceRating = document.querySelector(".expirience-form__rating");
	expirienceRating &&
		new StarRating({
			container: ".expirience-form__rating",
			hiddenInput: "#expirience-rating",
		});
});

/* -------------------------------------------------------------------------------------------------------------------------------------------------
noUislider и обработчик кнопки для мобильной версии фильтра (также скрипт для обнуления полей при ресете) - CATALOG FILTER
-----------------------------------------------------------------------------------------------------------------------------------------------------*/
import "./sections/catalog-aside-filter.js";

/* --------------------------------------------------------------------------------------------------------------------------
Обработчик карусели кнопок на странице фильтра в каталоге - BUTTONS CAROUSEL
-----------------------------------------------------------------------------------------------------------------------------*/
import "./sections/catalog-buttons-slider.js";

/* ------------------------------------------------------------------------------------------------------------------------------
Инициализация слайдера на странице авторизации - SWIPER AUTHORIZE 
--------------------------------------------------------------------------------------------------------------------------------*/
import "./sections/authorize-slider.js";

/* --------------------------------------------------------------------------------------------------------------------------
Обработчик редактируемого Input и TextArea
-----------------------------------------------------------------------------------------------------------------------------*/
import EditableInput from "./modules/editable-input.js";
const allEditableInputs = document.querySelectorAll(".editable");
allEditableInputs.forEach((input) => {
	new EditableInput(input);
});

/* ------------------------------------------------------------------------------------------------------------------------------
Инициализация все мультиселектов - Choices
--------------------------------------------------------------------------------------------------------------------------------*/
import "./modules/choices-all.js";
/* --------------------------------------------------------------------------------------------------------------------------
Обработчик горизонтального скролла для мультиселекта Choices
-----------------------------------------------------------------------------------------------------------------------------*/
import "./sections/choices-horizontal-scroll.js";

/* ------------------------------------------------------------------------------------------------------------------------------
Инициализация слайдера ПОХОЖИЕ ТОВАРЫ на странице ДОБАВИТЬ ТОВАР в ЛИЧНОМ КАБИНЕТЕ - SWIPER SIMILAR PRODUCTS SLIDER
--------------------------------------------------------------------------------------------------------------------------------*/
import "./sections/account-similar-slider.js";
