import { BaseHelpers } from "./helpers/base-helpers";
BaseHelpers.addLoadedClass();
BaseHelpers.calcScrollbarWidth();
BaseHelpers.addTouchClass();

/*--------------------------------------------------------------------------------------------------------------
Обработчик "Добавить в избранное" - LIKES LISTENER 
----------------------------------------------------------------------------------------------------------------*/
import "./mini/likes-listener.js";
/* ------------------------------------------------------------------------------------------------------------------------------
Миграция блоков и элементов при адаптиве - TRANSFER ELEMENTS
--------------------------------------------------------------------------------------------------------------------------------*/
import "./sections/transfer-elements.js";
/* ------------------------------------------------------------------------------------------------------------------------------
Инициализация слайдера ПРЕИМУЩЕСТВА на ГЛАВНОЙ - KEEN ADVANTAGE SLIDER
--------------------------------------------------------------------------------------------------------------------------------*/
import "./sections/advantage-slider.js";
/* ------------------------------------------------------------------------------------------------------------------------------
Инициализация слайдера ПОПУЛЯРНЫЕ ТОВАРЫ на ГЛАВНОЙ странице -  SWIPER POPULAR PRODUCTS SLIDER
--------------------------------------------------------------------------------------------------------------------------------*/
import "./sections/popular-products-slider.js";
/* ------------------------------------------------------------------------------------------------------------------------------
Инициализация слайдера МОИ ТОВАРЫ на страницах ЛИЧНОГО КАБИНЕТА -  SWIPER MY PRODUCTS SLIDER
--------------------------------------------------------------------------------------------------------------------------------*/
import "./sections/myproducts-slider.js";
/* ------------------------------------------------------------------------------------------------------------------------------
Инициализация первого слайдера на ГЛАВНОЙ - SWIPER MARKETING SLIDER
--------------------------------------------------------------------------------------------------------------------------------*/
import "./sections/marketing-slider.js";
/* ------------------------------------------------------------------------------------------------------------------------------
Инициализация слайдера в блоке КОМПАНИИ - SWIPER COMPANYS SLIDER
--------------------------------------------------------------------------------------------------------------------------------*/
import "./sections/companys-slider.js";
/* ------------------------------------------------------------------------------------------------------------------------------
Инициализация слайдера с миниатюрами в галлереи на странице товара - SWIPER PORODUCT GALLERY THUMBNAILS
--------------------------------------------------------------------------------------------------------------------------------*/
import "./sections/product-thumbnails-slider.js";

/* --------------------------------------------------------------------------------------------------------------------------
Паралакс для галлереи на странице товара
-----------------------------------------------------------------------------------------------------------------------------*/
import "./modules/product-gallery-parallax.js";

/*--------------------------------------------------------------------------------------------------------------
Обработчик кнопки КАТАЛОГ и внутренностей большого выпадающего меню с категориями (в мобильной и дестопной версии)
----------------------------------------------------------------------------------------------------------------*/
import CatsMenu from "./modules/cats-menu-prod";

const categoriesOverlayMenu = document.querySelector(".exp-catalog");
categoriesOverlayMenu &&
	new CatsMenu({
		parent: ".exp-catalog",
		openBtn: "#catalog-btn",
		catButton: "data-catIDoverlay",
		catBlock: "data-blockIDoverlay",
		backButton: "data-subcatback='overlay'",
		closeButton: "data-catsclose='overlay'",
		openSubListButton: "data-subcatslist='overlay'",
	});

/* --------------------------------------------------------------------------------------------------------------------------
Инициализация FANCYBOX
-----------------------------------------------------------------------------------------------------------------------------*/
Fancybox.bind("[data-fancybox]", {
	Carousel: {
		transition: "slide",
	},
	Images: {
		zoom: false,
	},
	showClass: "f-fadeIn",
});

/* --------------------------------------------------------------------------------------------------------------------------
Рейтинг на странице продукта (выбор кол-ва звезд в форме ОПЫТ ПОЛЬЗОВАТЕЛЯ)
-----------------------------------------------------------------------------------------------------------------------------*/
import StarRating from "./modules/rating-stars.js";
document.addEventListener("DOMContentLoaded", () => {
	const expirienceRating = document.querySelector(".expirience-form__rating");
	expirienceRating &&
		new StarRating({
			container: ".expirience-form__rating",
			hiddenInput: "#expirience-rating",
		});
});

/* -------------------------------------------------------------------------------------------------------------------------------------------------
noUislider и обработчик кнопки для мобильной версии фильтра (также скрипт для обнуления полей при ресете) - CATALOG FILTER
-----------------------------------------------------------------------------------------------------------------------------------------------------*/
import "./sections/catalog-aside-filter.js";

/* ------------------------------------------------------------------------------------------------------------------------------
Инициализация слайдера на странице авторизации - SWIPER AUTHORIZE 
--------------------------------------------------------------------------------------------------------------------------------*/
import "./sections/authorize-slider.js";

/* --------------------------------------------------------------------------------------------------------------------------
Обработчик редактируемого Input и TextArea
-----------------------------------------------------------------------------------------------------------------------------*/
import EditableInput from "./modules/editable-input.js";
const allEditableInputs = document.querySelectorAll(".editable");
allEditableInputs.forEach((input) => {
	new EditableInput(input);
});

/* ------------------------------------------------------------------------------------------------------------------------------
Инициализация все мультиселектов - Choices
--------------------------------------------------------------------------------------------------------------------------------*/
import "./modules/choices-all.js";

/* --------------------------------------------------------------------------------------------------------------------------
Обработчики горизонтального скролла для каруселей с кнопками 
-----------------------------------------------------------------------------------------------------------------------------*/
import HorizontalScroll from "./sections/horizontal-scroll.js";
document.addEventListener("DOMContentLoaded", () => {
	new HorizontalScroll(".choices__list--multiple");
	new HorizontalScroll(".dolly-multiselect__scroll");
	new HorizontalScroll("#filter-buttons-slider");
	new HorizontalScroll(".menu-company__group");
});

/* ------------------------------------------------------------------------------------------------------------------------------
Инициализация слайдера ПОХОЖИЕ ТОВАРЫ на странице ДОБАВИТЬ ТОВАР в ЛИЧНОМ КАБИНЕТЕ - SWIPER SIMILAR PRODUCTS SLIDER
--------------------------------------------------------------------------------------------------------------------------------*/
import "./sections/account-similar-slider.js";

/* ------------------------------------------------------------------------------------------------------------------------------
Account company photoslider
--------------------------------------------------------------------------------------------------------------------------------*/
import "./sections/account-company-photoslider.js";

/* ------------------------------------------------------------------------------------------------------------------------------
Dolly dropdown - выпадающие списки для просмотра информации (например стр. О Компании (Контакты))
--------------------------------------------------------------------------------------------------------------------------------*/
import DollyDropDown from "./sections/dolly-dropdown.js";
document.addEventListener("DOMContentLoaded", () => {
	new DollyDropDown();
});

/* ------------------------------------------------------------------------------------------------------------------------------
FAQ accordion toggle
--------------------------------------------------------------------------------------------------------------------------------*/
import { Accordion } from "./modules/accordion.js";

new Accordion('.accordion', {
	shouldOpenAll: false, // true
	defaultOpen: [1], // [0,1]
	collapsedClass: 'open',
});


/* ------------------------------------------------------------------------------------------------------------------------------
Скролл к активному элементу в сайдбаре на странице О КОМПАНИИ
--------------------------------------------------------------------------------------------------------------------------------*/
import ScrollActiveItem from "./modules/scroll-to-active.js";

const scroller = new ScrollActiveItem('.menu-company__group', 'active');
window.addEventListener('load', () => {
  scroller.scrollToActive();
});